# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import pandas as pd

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
temp = pd.read_csv('/Users/laetitia/IronHack/data-ft-par-labs/Labs/data/Temp_states.csv')

#### Print `temp`.

In [3]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [5]:
"""
your comments here

The City and State data types are objects and the Temperatures are float
"""

'\nyour comments here\n\nThe City and State data types are objects and the Temperatures are float\n'

#### Select the rows where state is New York.

In [6]:
# your code here
temp.loc[temp['State'] == 'New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [7]:
# your code here
temp[temp['State'] == 'New York'].mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [8]:
# your code here
temp[temp['Temperature'] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [9]:
# your code here
temp[temp['Temperature'] > 15]['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [10]:
# your code her
temp[(temp['Temperature'] > 15) & (temp['Temperature'] < 20)]['City']

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [11]:
# your code here
temp.describe()

       Temperature
count     7.000000
mean     15.158730
std       6.695265
min       3.333333
25%      11.944444
50%      17.222222
75%      19.722222
max      22.222222

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [12]:
employees = pd.read_csv('/Users/laetitia/IronHack/data-ft-par-labs/Labs/data/Employees.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [13]:
employees.dtypes

Department    object
Education     object
Title         object
Name          object
Years          int64
Salary         int64
dtype: object

In [14]:
"""
your comments here

The Department, Education, Title, Name are all objects and the Years and salary are integers
"""

'\nyour comments here\n\nThe Department, Education, Title, Name are all objects and the Years and salary are integers\n'

#### What's the average salary in this company?

In [17]:
# your code here
employees.groupby('Department').Salary.mean()

Department
Admin    76.325203
HR       74.237705
IT       70.671642
Sales    73.132231
Name: Salary, dtype: float64

#### What's the highest salary?

In [17]:
# your code here
employees.Salary.max()

120

#### What's the lowest salary?

In [18]:
# your code here
employees.Salary.min()

30

#### Who are the employees with the lowest salary?

In [19]:
# your code here
employees[employees['Salary'] == 30]['Name']

27         Sean
106        Luke
128        Adam
139        Rick
214        Neil
266      Marcel
452    Augustin
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [20]:
# your code here
employees[employees['Name'] == 'David']

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [21]:
# your code here
employees[employees['Name'] == 'David']['Salary']

0      58
124    31
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [22]:
# your code here
employees[employees['Title'] == 'associate']

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[158 rows x 6 columns]

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [50]:
# Method 1
# your code here
employees.head(3)

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [52]:
# Method 2
# your code here
employees.iloc[:3, :]

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

#### Find the employees whose title is associate and whose salary is above 55.

In [53]:
# your code here
employees[(employees['Title'] == 'associate') & (employees['Salary'] > 55)]

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
9        Admin    Master  associate    Kareem      3     104
10       Admin    Master  associate   Cynthia      1     114
16       Admin  Bachelor  associate    Shanon      1      99
18       Admin  Bachelor  associate     Megan      9      79
..         ...       ...        ...       ...    ...     ...
476      Admin       PhD  associate      Greg      8      93
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
494      Sales  Bachelor  associate   Vanessa     11     118

[104 rows x 6 columns]

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [54]:
# your code here
employees.groupby('Years')['Salary'].mean()

Years
1     75.863636
2     75.857143
3     74.571429
4     77.129032
5     73.857143
6     72.382353
7     73.840000
8     64.250000
9     76.741935
10    73.351351
11    74.866667
12    73.454545
13    71.935484
14    70.968750
15    69.758621
Name: Salary, dtype: float64

####  What is the average salary per title?

In [58]:
# your code here
employees.groupby('Title')['Salary'].mean()

Title
Analyst      73.703911
VP           72.907975
associate    73.968354
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [73]:
# your code here
employees.Salary.quantile([0.25, 0.5, 0.75])

0.25    50.0
0.50    72.0
0.75    97.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [29]:
# your code here

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [82]:
# your code here
employees.groupby('Department').agg({'Years':[min, 'mean', max],'Salary':[min, 'mean', max]})

           Years               Salary
             min      mean max    min       mean  max
Department
Admin          1  7.642276  15     30  76.325203  120
HR             1  7.172131  15     30  74.237705  119
IT             1  8.141791  15     30  70.671642  120
Sales          1  7.206612  15     30  73.132231  120

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [87]:
# your code here
employees.groupby('Department').Salary.agg([min, max]).diff(axis=1)
employees.groupby('Department')['Salary'].apply(lambda x: x.max() - x.min())

Department
Admin    90
HR       89
IT       90
Sales    90
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [93]:
# your code here
orders = pd.read_csv('/Users/laetitia/IronHack/data-ft-par-labs/Labs/data/Orders.csv', index_col=0)

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [94]:
# your code here
orders.dtypes
orders.describe()

,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [95]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [97]:
# your code here
orders.amount_spent.mean()

22.39474850474768

#### What are the highest and lowest purchase prices?

In [98]:
# your code here
orders['amount_spent'].agg([min, max])

min         0.0
max    168469.6
Name: amount_spent, dtype: float64

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [100]:
orders.columns

Index(['InvoiceNo', 'StockCode', 'year', 'month', 'day', 'hour', 'Description',
       'Quantity', 'InvoiceDate', 'UnitPrice', 'CustomerID', 'Country',
       'amount_spent'],
      dtype='object')

In [102]:
# your code here
orders[orders['Country'] == 'Spain']

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
6421,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
6422,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
6423,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.00
6424,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
6425,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
535271,581193,23291,2011,12,3,17,dolly girl childrens cup,2,2011-12-07 17:05:00,1.25,17097,Spain,2.50
535272,581193,85232D,2011,12,3,17,set/3 decoupage stacking tins,1,2011-12-07 17:05:00,4.95,17097,Spain,4.95
535273,581193,22721,2011,12,3,17,set of 3 cake tins sketchbook,2,2011-12-07 17:05:00,1.95,17097,Spain,3.90
535274,581193,23241,2011,12,3,17,treasure tin gymkhana design,1,2011-12-07 17:05:00,2.08,17097,Spain,2.08
535275,581193,23247,2011,12,3,17,biscuit tin 50's christmas,1,2011-12-07 17:05:00,2.89,17097,Spain,2.89

#### How many customers do we have in Spain?

In [38]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [39]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [40]:
# your code here

#### Select all free orders.

In [41]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [42]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [43]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [44]:
# your code here

#### Select all orders made in the month of August.

In [45]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [46]:
# your code here

#### What's the  average amount of money spent by country?

In [47]:
# your code here

#### What's the most expensive item?

In [48]:
# your code here

#### What is the average amount spent per year?

In [49]:
# your code here